
//白水黑土红楼梦人物素描

var character = new Array();
var profile = new Array();
var sexflag = new Array();
var mainflag = new Array();
var goldflag = new Array();

var i = 1;
for(i = 1; i <= 456; i++)  { character[i] = ''; profile[i] = '';sexflag[i] = 0; mainflag[i] = 0;goldflag[i] = 0;}

character[1] = "艾官"
profile[1] = "  艾官是老外，我不懂戏剧，不知道老外是个什么角色，不过可以肯定的是不是最重要的人物。她在小剧团解散后给了探春，这不是随便给的，说明老外和探春之间有什么联系。（至于什么联系，有待考证，哪位大侠给说明说明）。她在书中单独的活动只是在探春面前为藕官烧纸钱，宝玉认了的事告了夏婆子，那也没什么，反正好像没什么大不了的事，我还真说不出个子丑寅卯来。"

character[2] = "白老媳妇"
profile[2] = "  白老媳妇是金钏儿和玉钏儿之母，她的活动好像就是把金钏儿领了出去，可是还没有看好，让金钏儿跳井自杀了，可惜可惜，看来母女之间也没有心有灵犀啊，呵呵，一笑。"

character[3] = "板儿"
profile[3] = "板儿是狗儿的儿子，狗儿是王成的儿子，王成是他父亲的儿子（这不是废话吗？），王成父亲自认是王夫人的兄弟，那么王成和凤姐是一辈的，狗儿和巧姐是一辈的，呵呵~如果巧姐真的嫁给了板儿的话，那真是大逆不道了，想想杨过和小龙女被天下英雄所不齿，可知在古代，这辈份的事可是头等大事，所以我一直怀疑巧姐是否嫁给了板儿。板儿在书中好像除了要吃果子就是让刘姥姥教训了几句，实在不知道他为人如何？所以素描也只能到此结束了。"
sexflag[3] = 1; 
mainflag[3] = 1;

character[4] = "伴鹤"
profile[4] = "  伴鹤是宝玉的小厮，第一次出场就是没事在在房檐上掏小雀儿玩，可知也不是个省油的灯，不过他远没有茗烟那么出名罢了。他的另外一次出场就是和一大堆人陪着宝玉出门，所以只是一个配角的配角，很难为他立书作传。"
sexflag[4] = 1;


character[5] = "宝蟾"
profile[5] = "  她是夏金桂、薛家大奶奶的丫头，不知道算不算陪房，好像算不上吧，在第80回才第一次出场，有可能是曹公写的最后一个出场人物，那么也算是她的荣幸了，呵呵。遗憾的是，她不是什么好鸟，和夏金桂串通一气害死了香菱，不过她也冤枉，她也只是夏金桂手中的工具而已，被利用了一下，和秋桐有些相似而已。"

character[6] = "宝官"
profile[6] = "  宝官是小生，好像藕官也是小生，不知道一个小剧团里面是否有两个小生。她和怡红院也是有些渊源的，书中写她曾和玉官去怡红院玩过，后面没有她的去向了，是放出去的时候跟着她的家人走了？"
 
character[7] = "宝琴"
profile[7] = "  宝琴是个完美的象征，长的漂亮，人又聪明，见多识广，写诗作文在大观园中都是一流，按说这样的女孩应该是男孩子们的首选才对啊，可是不论哪次调查，她都没有出彩，看来有缺点的女孩比没有缺点的女孩要招人爱，所以黛玉有这么多人喜爱也是正常的，遗憾的是不知道她结局如何？有人说她不属于薄命司的，可是我宁愿相信是万艳同悲，只是她不知道会是个什么悲剧？唉！想想电视剧中那个宝琴，真让我气愤，难道那个搬演宝琴的演员就不觉得自愧吗？"
mainflag[7] = 1;

character[8] = "宝珠"
profile[8] = "  宝珠是可卿的丫头，她比瑞珠聪明，不但留得小命一条，还当上了“小姐”，可惜的是这小姐不是那小姐，如果她真的也是可卿和贾珍风流的见证人的话，那么留得小命也是一种奢侈了。"
 
character[9] = "保宁侯"
profile[9] = "  保宁侯靠着他儿子在书中露了一面，是王子腾的亲家，“偏生近日王子腾之女许与保宁侯之子为妻”。不知道在王家倒了之后，他有没有受到牵连？"
sexflag[9] = 1;

character[10] = "抱琴"
profile[10] = "  抱琴是元春的丫头，“琴棋书画”之老大，呵呵，看来元春的音乐细胞比其他三姐妹要多点，唉，当奴婢的，真是得摊上一个好主子啊，否则连“嫁鸡随鸡”都不如啊。"
 
character[11] = "鲍二"
profile[11] = "要说红楼中的男人最体面的是谁，我选鲍二，不过作为奴才你又能要求他怎么样呢？琏二爷还给他娶第二个老婆已是他的非分了。"
sexflag[11] = 1;

character[12] = "鲍二家的"
profile[12] = "这是书中唯一一个有两个人而同用一个名字的情况，头一个估计是个荡妇，也是个烈妇，其实如果她不自杀，难保凤姐不使什么绊子，也许死了倒是件好事。后一个倒没见什么出格的事，伺候着尤二姐虽然是件好事，可是不知道凤姐会不会事后算帐，唉，她们俩都和凤姐有点瓜葛。"


character[13] = "北静王"
profile[13] = "当年的北静王在四大王中功劳最高，此处的北静王应该单指水溶才对，“水溶是个贤王，且生得才貌双全，风流潇洒，每不以官俗国体所缚。”大概在宝玉心中水溶是为数不多的几个不算是臭男人的男人。还能给宝玉当借口挡挡事，也算是他的好事一件了。"
sexflag[13] = 1;
mainflag[13] = 1;

character[14] = "鲍太医"
profile[14] = "鲍太医老人家在第28回出现过一次，大概是给黛玉开过什么药，不过也不见怎么有效，当然了，黛玉的病不是凡人能治好的，所以大概也不能怪他。"
sexflag[14] = 1;

character[15] = "北静王妃"
profile[15] = "北静王妃当然是北静王的王妃了（废话一句），只有在71回贾母生日的时候出过场，什么跟着南安太妃送了小姐们礼物然后坐了坐就走了。估计长的也是“神仙姐姐”一般。"

character[16] = "碧痕"
profile[16] = "作为宝玉丫头之一，估计给人印象最深的就是有一次她服侍宝玉洗澡，足有两三个时辰，也不知道俩人在里面干了什么，呵呵，似乎很暧昧啊，这也是宝玉的罪证之一。还有就是和秋纹奚落小红了，唉，丫头们内部的斗争可见一斑啊。"
mainflag[16] = 1;

character[17] = "碧月"
profile[17] = "碧月是李纨的丫头，活动不多，有印象的大抵是刘姥姥进大观园，众人要打扮她，那个捧着装花的盘子的就是碧月了。"
 
character[18] = "玻璃"
profile[18] = "有一个“金星玻璃”，不知道是一个人还是两个人，不过玻璃是确有其人，是贾母的丫头之一，她的出场是为贾母收拾了一次衣物。"

character[19] = "跛足道人"
profile[19] = "此乃世外高人也，也是一个线索人物。他的风月宝鉴让贾瑞丧了命，他让通灵宝玉救了宝玉和凤姐，他的《好了歌》勾走了甄士隐，也让我这辈子没有了斗志。唉！"
sexflag[19] = 1;
mainflag[19] =1;

character[20] = "卜固修"
profile[20] = "清客相公也，也叫“不顾羞”，他跟着贾蔷去姑苏买小戏子，能干什么呀，纯粹是吃饱了不干事的主。"
sexflag[20] = 1;

character[21] = "卜世仁"
profile[21] = "贾芸的娘舅，也叫“不是人”，俗话说“舅如娘亲”，可是他却看着自己的外甥有困难也不愿帮衬一下，可见真的是个“不是人”。不过话又说回来了，如果不是他不愿帮贾芸，也许贾芸也不会一门心思想进贾府干点事，那么也不会遇见小红，也无法认宝玉为父了，那么宝玉在狱神庙呆着的时候也不会有人来看他了，可见他的功劳也不小啊，呵呵。"
sexflag[21] = 1;

character[22] = "彩儿"
profile[22] = "四姑娘屋里的小丫头，她出场倒不是因为她有什么丰功伟绩，而是因为她娘嘴巴不干净，让林之孝家的赶了出去，借着她娘的光，在书中露了回脸，可也是“没抱琵琶遮着面”。"

character[23] = "彩儿的娘"
profile[23] = "书中说她嘴巴不好，也不知道是真的不好，还是婆子们内部斗争的牺牲品，女儿都只是个末等丫头，估计这娘也高不到哪儿去，在贾府里还不是任人宰割？"

character[24] = "彩哥"
profile[24] = "赖嬷嬷的孙子当了官了，凤姐打发彩哥去打赏东西，借着赖嬷嬷的嘴在书中出来了一次，此外，无下文。"

character[25] = "彩鸾"
profile[25] = "这彩鸾是谁的丫头，书上没有明说，我也不想考证，估计用什么人名对称法呀，什么排除法呀能得出一个似是而非的答案来，还是算了吧，免得又挑起一段公案。她的唯一出场是来给宝玉拜寿。"

character[26] = "彩明"
profile[26] = "对于凤姐来说，如果平儿是她的管家，那么彩明就是她的帐房先生，专门给她记记帐啊，念念帐什么的，好像也做过什么传话、什么跑腿的工作，只是不多而已。"

character[27] = "彩屏"
profile[27] = "惜春的丫头，在29回一大家子去清虚观打醮的时候跟着主子去了一次，此后再无出场。"

character[28] = "彩霞"
profile[28] = "彩霞好歹也是个大丫头，只是跟的主子不怎么样，为难她了，难得的是她对环三爷还一片真心，倒不论她对贾环是真的喜欢还是想混个姨娘的位置，她能拒绝宝玉的调笑而专心对贾环就已经很让人另眼看待了，当然了，也不能去说她的眼光不行，逮着一个贾环是可靠的，不像宝玉那么多花花肠子，一点都不可靠，能认识到这点已不容易。"
mainflag[28] =1;

character[29] = "彩云"
profile[29] = "这云和霞搅到一块是分不清楚，这不，有人叫了这名字，连人也分不清了，彩云和彩霞似乎在一开始是两人，倒后来越来越象一个人了，也不知同贾环好的到底是彩云还是彩霞，还是贾环姐妹双收？还有一个问题，这彩云和彩霞到底是王夫人的丫头还是环三爷的丫头，应该说如果是王夫人的丫头，那么不大可能和贾环混到一块去，可是一会彩霞给王夫人收拾东西，一会又彩霞和贾环过从甚密。"
 
character[30] = "曹雪芹"
profile[30] = "把曹雪芹作为一个书中人物，实在是他自己惹的祸，他肯定想不到的是他害苦了多少后来人，连我这样的俗而又俗的人也禁不住要附庸风雅一把，有事没事老想着红楼。"
sexflag[30] = 1;
 
character[31] = "长府官"
profile[31] = "不知道这长府官是朝廷的一个命官还是北静王府的一个“内官”，在送可卿去铁槛寺的路上水溶“命长府官主祭代奠”。"
sexflag[31] = 1;

character[32] = "炒豆儿"
profile[32] = "炒豆儿是李纨的一个小丫鬟，尤氏去稻香村的时候，正是她端水给尤氏洗脸。李纨对丫头似乎要求不怎么严，这不，炒豆儿端水服侍尤氏的时候就敢不跪着。"

character[33] = "陈瑞文"
profile[33] = "“齐国公陈翼之孙世袭三品威镇将军陈瑞文”，可知在书中陈翼多半是个死人，当年的“八公”之一；而陈瑞文呢，大抵就是个活人了。"
sexflag[33] = 1;

character[34] = "程日兴"
profile[34] = "古董行的程日兴，没事帮着贾府在修大观园的时候管过事，给薛蟠送过“这么粗这么长粉脆的鲜藕，这么大的大西瓜，这么长一尾新鲜的鲟鱼，这么大的一个暹罗国进贡的灵柏香熏的暹猪。”，呵呵，还挺会讨好人的。好像还能画点什么，尤其是美人啊什么的。可见如果在今日也算个艺术家了。"
sexflag[34] = 1;

character[35] = "痴梦仙姑"
profile[35] = "太虚幻境中的众仙姑之一，和钟情大士、引愁金女、度恨菩提三人合称“太虚四大金刚”，呵呵，纯属白水搞笑而已。痴梦？既然人生如梦，那么万事又何必痴迷于其中呢？“痴迷的，枉送了性命”！"
 
character[36] = "仇都尉"
profile[36] = "这都尉是多大的一个官啊？好像也不小了，起码他儿子敢和冯紫英打架，要知道冯紫英可是神威将军的公子。"
sexflag[36] = 1;

character[37] = "锄药"
profile[37] = "宝玉的小厮之一，虽然不及茗烟那么得力，但是宝玉出门多带着他，也是个淘气的主，和扫红、墨雨、茗烟大闹学堂，从此名震天下。呵呵，还能和茗烟下下象棋，不过可不是棋坛高手，这不，为了一个“车”，和茗烟吵起来了。"
mainflag[37] = 1;
sexflag[37] = 1;

character[38] = "春纤"
profile[38] = "黛玉的丫头，出来过两次，一次是跟着去了趟清虚观，还有一次是晴雯给黛玉送旧帕子去，见着春纤在晾手帕子。"

character[39] = "春燕"
profile[39] = "何婆的小女、宝玉的丫头，接着她的口，说出了宝玉那著名的“女儿三段论”。蔷薇硝事件的参与者之一，对于这件事，我总觉得芳官是有错的，贾环好歹也是个爷们，骗人家就是不应该，而且这里贾环是想弄点蔷薇硝去讨好彩霞（彩云），多少也有点讨厌得可以原谅，呵呵。"

character[40] = "翠缕"
profile[40] = "好像原来也是贾府的，后来跟了湘云去了，也算是贾府中丫头中的元老了，和袭人、鸳鸯是同一个级别的。是湘云的大丫头，印象最深的恐怕就是和湘云讨论世间万物有阴阳了。还有就是捡到了宝玉丢的那个金麒麟。"
mainflag[40] = 1;

character[41] = "翠墨"
profile[41] = "三姑娘的丫头，也是个高级别丫头，大抵和袭人是同等地位，当然了，后来就赶不上了，袭人享受姨娘待遇，而她还只有丫头薪金，呵呵。因为三姑娘擅长书法，所以她叫翠墨，墨者，黑土也。哈哈。"
 
character[42] = "翠云"
profile[42] = "“那边太太常带过几个小姨娘来，如嫣红翠云等人，皆系年轻侍妾”，这是她唯一的一次露脸。这个“那边太太”应该是邢夫人吧，看来翠云也是贾赦的小老婆了，可惜了。"

character[43] = "大姐"
profile[43] = "这个大姐是否就是巧姐呢？怎么曹公还犯这样的错误，真让人受不了，27回中就有了个大姐和巧姐（庚辰本），42回刘姥姥又给大姐取名叫巧姐，不要和我说这是曹公的高明之处啊，他不是神也是人，我肯定这是他的一个bug。这大姐也够倒霉的，一出来就开始病，一直病到她不叫大姐而叫巧姐了。至于巧姐是否经常生病，那不是大姐的事了，呵呵。"
mainflag[43] = 1;

character[44] = "戴良"
profile[44] = "“仓上的头目戴良”，这是关于他的所有档案，籍贯，年龄，婚否不可考。"
sexflag[44] = 1;

character[45] = "戴权"
profile[45] = "“大明宫掌宫内相戴权”，果然“代权”，任人唯私、贪污腐败都有，该杀！可惜这样的官员中国从古到今都太多了，杀也杀不干净，这两天在琢磨一些新加坡的东西，如果把他送到现在的新加坡去就好了。"
sexflag[45] = 1;

character[46] = "单大良"
profile[46] = "应该是有些地位的奴才了，和赖大等是一个级别的，过了年，还能请贾府的诸位去吃年酒，可见不光有些面子还得有些money。"
sexflag[46] = 1;

character[47] = "单大娘"
profile[47] = "不知这单大娘和上面的单大良有什么关系，据我的估计啊，这个单大娘应该是那个单大良的老婆，也就是单大良家的，去看过一次宝玉。南方人多半l、n不分，所以是“单大liang2是单大niang2的老婆”，哈哈，我分特！"

character[48] = "单聘仁"
profile[48] = "又叫“善骗人”，清客相公一个，也是一个混饭吃的主，瞧这名字取的，当年他爸也不动动脑子。唉，受了没有文化的苦啊。"
sexflag[48] = 1;

character[49] = "靛儿"
profile[49] = "不知道是谁的丫头，一点眼色也不带，宝钗都不高兴了，还赖她藏了她的扇子，被抢白一通也是活该。"

character[50] = "定城侯"
profile[50] = "定城侯之孙世袭二等男兼京营游击谢鲸来给可卿送行。而定城侯则不知是死人还是活人。"
sexflag[50] = 1;

character[51] = "东平郡王"
profile[51] = "只是在贾敬生日的时候派人持名帖送寿礼来，东平、南安、西宁、北静，平安宁静，这皇帝还真不赖，封官“平安”还一般，封官“宁静”可见不是个草包，“宁静而至远”嘛！"
sexflag[51] = 1;

character[52] = "豆官"
profile[52] = "小花面豆官，小花面是干什么的呢？剧团解散后给了宝琴，所以我总觉得这“小花面”和宝琴之间是有某种联系的，可是又说不清楚。这豆官啊，也是唯恐天下不乱的人，毕竟是小孩子，听说芳官受了欺负，“先便一头，几乎不曾将赵姨娘撞了一跌”。呵呵，好在贾府的人谁都不愿帮赵姨娘，否则以下犯上，叫这几个官吃不了，兜着走。"
mainflag[52] = 1;

character[53] = "度恨菩提"
profile[53] = "太虚幻境中的仙姑之一，不知道菩提是何等神仙，不过看过西游记后，悟空的师父菩提祖师是《西》中我最景仰的神仙，呵呵。这个世界上也许“度恨”是最难的......"
 
character[54] = "多姑娘"
profile[54] = "“这媳妇有天生的奇趣，一经男子挨身，便觉遍身筋骨瘫软，使男子如卧绵上；更兼淫态浪言，压倒娼妓，诸男子至此岂有惜命者哉”，呵呵，记得在水母红楼版有人说我太正经，在签名档里应该加一句“喜欢的女孩还要象多姑娘一样性感”，我分特，不过红楼诸女子中最性感的理所当然的就是这多姑娘了，难怪贾琏丑态毕露。"

character[55] = "多浑虫"
profile[55] = "又叫多官，不过此官不是彼官，既不是个公仆也不是个优伶，只是个“极不成器破烂酒头厨子”懦弱无能。他老婆多姑娘（灯姑娘）勾人引汉，他也不理论，估计也没法理论。有酒便是娘，管老婆干什么？他还是晴雯的姑舅哥哥，摊上这么一个表哥，晴雯也够倒霉的，sigh，一切皆命定啊。"
sexflag[55] = 1;

character[56] = "二丫头"
profile[56] = "正宗的乡村女孩，胆大而淳朴，宝玉在去馒头庵的时候遇上的女孩。穷人的孩子早当家，在大观园里的女孩子们吟诗作画的时候，她得去纺线，带小孩，没准还得去割猪草，放牛什么的，找老婆还是这样的实在，呵呵。看来我的签名档得加上“要象二丫头一样勤快”了，呵呵。"
 
character[57] = "方椿"
profile[57] = "是个花儿匠，贾芸在府里当差时，买的花草树木什么的就是出自他的店里，不知道那几盆流芳百世的海棠花是否也是他栽培出来的？"
sexflag[57] = 1;

character[58] = "芳官"
profile[58] = "本姓花，是个正旦，给了宝玉，按照我的想法，既然是正旦，应该是那12个女孩中最漂亮的了，把她给宝玉，也不是随便给的。芳官本自伶俐，唱戏也是拔尖的，晴雯说她不省事，袭人说她“太可恶”，麝月说她淘气，呵呵，漂亮的女孩子嘛，狂点也是可以原谅的，就象阮籍嵇康，狂有他们狂的本事。被干娘欺负，她敢明不平，生性天真、无忌。蔷薇硝和玫瑰露事件的主角之一，“心中因是蕊官之赠，不肯与别人”，重朋友，轻“权贵”，性情中人。就是和赵姨娘干架也煞是可爱，“泼哭泼闹”，呵呵。“面如满月犹白，眼如秋水还清”，唉，芳官，叫我怎么说好呢？再写下去，我想我会爱上你了，:PPP。替宝玉喝酒，扮小厮，取名“耶律雄奴、温都里纳”，无一不透露着她的可爱和顽皮。可是正是她的顽皮和伶俐害了她，被赶了出去，最终跟了水月庵的智通，可是这智通也是“巴不得又拐两个女孩子去作活使唤”，可恶可恶。这么可爱、漂亮、聪明、伶俐、天真、顽皮的女孩从此遁入空门受那奴役苦，一想到这，我不禁想为芳官一哭！叹！叹！！叹！！！"
mainflag[58] = 1;

character[59] = "翡翠"
profile[59] = "贾母的丫头，为贾母收拾东西的，不见其他表现，贾母丫头的名字的特点就是由一个连绵词（是这个名字吗？10多年前学过的东东，捎肠刮肚才记起这么一个词语来）命名的，什么“鸳鸯”、“琥珀”等等。"

character[60] = "费大娘"
profile[60] = "“那边太太作陪房费大娘”，什么意思？费大娘是刑夫人的陪房？当年一个女孩子出嫁陪房的数目有限制的吗？可能是随便的吧，反正红楼梦里起码还有5、6家陪房。"

character[61] = "丰儿"
profile[1] = "凤姐的小丫头，出场不少，性格不明。大抵是干些杂事，送送东西，传传话，没事还得服侍平儿，凤姐发疯了的时候也哭得“泪天泪地”的，可见对凤姐还是很有感情的。另外，抄检大观园的时候也是去了的。"

character[62] = "封氏"
profile[62] = "士隐嫡妻，情性贤淑，深明礼义。女儿丢了，丈夫跟着道士跑了，还被那不是人的爹连蒙带骗的，也真够可怜的。"

character[63] = "封肃"
profile[63] = "士隐的岳丈，嫌贫爱富的主，讨人嫌的就是他这样的人，有点事就吓得屁滚尿流，有点小利就乐得屁颠屁颠的。连女婿的家产也要骗，真是油蒙了心了。"
sexflag[63] = 1;

character[64] = "冯胖子"
profile[64] = "永兴节度使，想给儿子买个官，无奈人家瞧不起他，连应付他的功夫也没有。官小啊，没办法，就象现在的乡长要想和县长套近乎，人家才懒得搭理你呐。"
sexflag[64] = 1;

character[65] = "冯唐"
profile[65] = "冯紫英他爹，神武将军。“冯唐易老，李广难封”，不知曹公在取这个名字的时候是否也有此意。"
sexflag[65] = 1;

character[66] = "冯渊"
profile[66] = "冯渊真逢冤，英莲真应怜！多情公子一个，难得对英莲一片痴情，每当看到他的故事，我总想起那个“某个名人（忘了谁了）和小麻雀的故事”，都是一时耽误，造成终身遗憾啊！"
sexflag[66] = 1;

character[67] = "冯紫英"
profile[67] = "神威将军公子，也是个纨绔子弟，是宝玉心中少数几个非臭男人中的一个。荐了大夫给可卿看病，宴请宝玉、薛蟠和琪官，从而有了宝玉把千古绝唱的《红豆曲》，这是我最喜欢的红楼曲子了。一个芳官我两天没写，一个冯紫英，我差点一个礼拜没有动笔了，因为总觉得写这么点太少，写多一点有觉得没的好写。哦，再说一点吧，我宁愿相信他日后没有去上战场。"
sexflag[67] = 1;

character[68] = "傅秋芳"
profile[68] = "通判的妹妹，“有几分姿色，聪明过人”，在当年也是晚婚晚育的典型人物啊，都23了，还没嫁人，呵呵，都怨那个官迷心窍的哥哥，想着把妹妹变成一个往上爬的捷径，一点也不为妹妹的幸福着想，哎，再过几年就是老姑娘了，弄不好，只能给人做小了，何苦来着？"

character[69] = "傅试"
profile[69] = "这就是那个那个官迷心窍的通判哥哥，是个官场暴发户，瞧不起人家，可是别人也瞧不起他，害苦了妹妹，自己也得不了好。可见这看不起暴发户是中国人的传统，现在也一样，书上那些暴发户的形象总是腆着个大肚子，嘴里吐不出象牙来，呵呵，估计这么写的人多少有些酸葡萄心理。"
sexflag[69] = 1;

character[70] = "狗儿"
profile[70] = "这狗儿也就是板儿的老爸，“利名心最重”又死要面子，不过也不能怪他，男子汉，大丈夫嘛，总不能干这上门乞讨的事儿。好像也不是全无能耐，还能帮着周瑞争买田地。"
sexflag[70] = 1;

character[71] = "拐子"
profile[71] = "这拐子尽干伤天害理的事，被打死也是活该，自己死了不足惜，只是害苦了香菱了，唉。"
sexflag[71] = 1;

character[72] = "韩奇"
profile[72] = "锦乡侯公子韩奇，有钱公子一个，其他一概不祥，给可卿送葬时来过。"
sexflag[72] = 1;

character[73] = "何婆"
profile[73] = "春燕的妈。老糊涂一个，典型的鱼眼珠，好像还抬举她了，既然是鱼眼珠，那当年也曾是宝珠了，不光欺负干女儿，连好端端的女儿也看不顺眼，呵呵，还想给宝玉吹汤，真是这么多年白混了。"

character[74] = "侯孝康"
profile[74] = "修国公侯明之孙世袭一等子侯孝康，也是“八公”子弟，有一事不明，这护官符上只有贾史王薛，那么这别的人干吗去了？好像这些人离贾府也不远啊，应该是在同一个地方吧，他们的官衔不一定高过贾府，但怎么也比薛家高吧。"
sexflag[74] = 1;

character[75] = "胡君荣"
profile[75] = "也就是给二姐看病的那个庸医，这小子腿脚倒是挺利索的，听到贾琏要拿他，卷铺盖就跑了。又有一事不明：为何他见了二姐后，“魂魄如飞上九天，通身麻木，一无所知。”不会是惊艳吧，好像有很多人考察出很多原因，可是一直没有令人信服的。"
sexflag[75] = 1;

character[76] = "胡老爷"
profile[76] = "这是与红楼人物八竿子打不着的一个人物，生了个儿子，叫净虚念三日《血盆经》。因此耽误了净虚去贾府走动。"
sexflag[76] = 1;

character[77] = "胡氏"
profile[77] = "金荣他妈，也就是回目里的那个金寡妇吧，比他小姑子要明白事理一些，知道儿子的“幸福生活”来之不易，也知道自己有多大份量。"

character[78] = "胡斯来"
profile[78] = "他这名字就不用改了，可不就是胡来嘛？看他的身份应该也是个清客，给薛蟠过生日时是去了的。"
sexflag[78] = 1;

character[79] = "琥珀"
profile[79] = "一看名字就知道是贾母的丫头，出场不少，给贾母收拾衣物，准备出门；螃蟹宴的时候，给凤姐敬酒，奚落平儿，平儿本想报复琥珀，没想到摸了凤姐一脸的蟹黄，哈哈，每次看到这个时候，忍不住都要大笑。还提醒刘姥姥路滑，心好，不似鸳鸯和凤姐那么促狭，呵呵。还在平儿挨打、鸳鸯绝婚等时候出来过，可是都是传传话什么的。不知在贾母归天后，她去哪了，那次小厮们求配，她正好生病了，因此也没有找个人家。"
 
character[80] = "花自芳"
profile[80] = "袭人的哥哥，虽然出场就只有那次宝玉懵懵懂懂跑到他们家去看袭人的一次，可是给我的感觉是一个值得信赖的大哥哥，也明白事理，尤其是能理解妹妹。"
sexflag[80] = 1;
 
character[81] = "璜大奶奶"
profile[81] = "呵呵，这个人最逗了，自己本来地位不高，在她嫂子面前逞强，信誓旦旦地要为他侄儿讨回一个“公道”，可是一见了贾珍和尤氏就蔫了。活象现在很多电视剧里的黑社会小头目，呵呵。"

character[82] = "蕙香"
profile[82] = "原名芸香，后改名四儿，“生得十分水秀，聪敏乖巧不过”，和宝玉同一天生日。在怡红院里大概是个三等丫头。你说这丫头一心想讨好主子往上爬到底该怎么看待呢？袭人惦记着姨娘的位置埃了多少后来人的骂，小红稍微表现一下，就被晴雯奚落一通，这个聪敏乖巧的四儿一见有机会也“变尽方法笼络宝玉”，可怜最后被某人告了密，让王夫人给赶出去了。"
mainflag[82] = 1;

character[83] = "霍启"
profile[83] = "又名“祸起”，他一出场就闯祸了，丢了英莲，苦了甄费，sigh。"
sexflag[83] = 1;

character[84] = "佳蕙"
profile[84] = "宝玉的小丫头，不光地位低，年龄也小，和小红比较要好，干点小杂活，比如晴雯撕了扇子，她去收拾什么的，估计一年半载的也难让宝玉看见一眼。"

character[85] = "贾（王扁）"
profile[85] = "呵呵，终于写到姓贾的人物了，没想到第一个竟然是他，也不知他是贾家的那个旁支亲戚，贾敬死后，他帮着打打杂。"
sexflag[85] = 1;

character[86] = "贾菖"
profile[86] = "也是个干事的人，后来还到了凤姐麾下办事，大观园修建时的监工之一，敬老爷丧事的执事之一。"
sexflag[86] = 1;

character[87] = "贾琛"
profile[87] = "才写三个姓贾的就觉得实在太难写了，什么都没干，一大堆名字里面夹杂着这么一个名字也算是出场了，曹公写他们无非是说明贾家人多，拍电视的时候得多找几个群众演员，呵呵。他的唯一出场就是可卿死后，贾珍安排他去陪客。"
sexflag[87] = 1;

character[88] = "贾敕"
profile[88] = "群众演员之一，在书中看不出他是何许人也，不过根据他的名字能猜到个大概，文字辈的旁亲，仅此而已。"
sexflag[88] = 1;

character[89] = "贾琮"
profile[89] = "嗯，这个人物还有得一点写的，倒不是说因为他有多少故事，而是因为邢夫人说过：“那里找活猴儿去！你那奶妈子死绝了，也不收拾收拾你，弄的黑眉乌嘴的，那里象大家子念书的孩子！”所以无数红学家猜测他就是冷子兴所说的贾赦的另外一个儿子。还有53回里祭祖的时候“贾敬主祭，贾赦陪祭，贾珍献爵，贾琏贾琮献帛，宝玉捧香，贾菖贾菱展拜毯”，贾琮和贾琏同时出现了，奇怪的是贾环没有来，反而是贾菖贾菱来了，书中还有一些证据，比如“可巧这日乃是清明之日，贾琏已备下年例祭祀，带领贾环、贾琮、贾兰三人去往铁槛寺祭柩烧纸。（58回）”、“正值贾环贾琮二人来问候宝玉（64回）”、“两处遂也命贾环、贾琮、宝玉、贾兰等四人于饭后过来，跟着贾珍习射一回，方许回去。（75回）”。所以我大抵也认可这个贾琮就是贾赦的另外一个儿子，不过终究曹公没说。"
sexflag[89] = 1;

character[90] = "贾代化"
profile[90] = "宁公之子，贾敬之父，“任京营节度使世袭一等神威将军”。可惜他的儿子、孙子、曾孙都不怎么争气。发现一个规律：宁府都是单传，容府大概都是不止一个儿子的。呵呵，说句题外话，按照我家的家谱，我的下一辈就是“代”字辈，“代”字可不好取名字，将来我的孩子叫什么呢？//think :PPPPPPPPPPPP :)"
sexflag[90] = 1;
 
character[91] = "贾敦"
profile[91] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[91] = 1;

character[92] = "贾效"
profile[92] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[92] = 1;

character[93] = "贾珩"
profile[93] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[93] = 1;

character[94] = "贾琛"
profile[94] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[94] = 1;

character[95] = "贾璘"
profile[95] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[95] =1;

character[96] = "贾菖"
profile[96] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[96] = 1;

character[97] = "贾菱"
profile[97] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[97] = 1;

character[98] = "贾琼"
profile[98] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[98] = 1;

character[99] = "贾蓁"
profile[99] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[99]=1;

character[100] = "贾萍"
profile[100] = "群众演员，生卒不可考，先辈后代不可究。"
sexflag[100] = 1;
