
character[301] = "王仁"
profile[301] = "凤姐胞兄，14回中回南，49回进京，其实他在前80回就这么点事，不过大多数读者还是把他看作了“那爱银钱忘骨肉的狠舅奸兄”中的“狠舅”。因为书中巧姐的舅舅出场的只有他，呵呵。"
sexflag[301] = 1;

character[302] = "王荣"
profile[302] = "只在52回跟宝玉出门时名字出来了一下。好家伙，一个宝玉出门，跟着保镖和服侍的人有10来个，这派头可比得上如今的国家元首了，呵呵（其实我也不知道和哪个级别相似，瞎比了）。"
sexflag[302] = 1;

character[303] = "王善保家的"
profile[303] = "邢夫人的陪房，出来的挺晚的，不过大家肯定忘不了她，因为一出来就没好事，首先把晴雯赶走了，kick to death，:pp，接着是一块抄捡大观园，害了自己的外孙女，不过给探春打了一嘴巴子还是比较出气的，呵呵。"
mainflag[303] = 1;

character[304] = "王信"
profile[304] = "不明"
sexflag[304] = 1;

character[305] = "王信家的"
profile[305] = "他们夫妻俩和书中别的夫妻俩不大一样，别的一般都是家的干的事多，做丈夫的接着妻子的脸露了一下名字，他们俩相反，王信家的没什么事，倒是王信在68回中在让张华告贾府的事中帮着打点察院。"

character[306] = "王兴"
profile[306] = "不明"
sexflag[306] =1;

character[307] = "王兴媳妇"
profile[307] = "这夫妻俩就正好与王信夫妇相反，王兴没有出场，只有他媳妇在14回中凤姐在宁国府杀鸡给猴看的时候出来过，也是凤姐手下办事的婆子。"

character[308] = "王一贴"
profile[308] = "天齐庙的老道，“这老王道士专意在江湖上卖药，弄些海上方治人射利，这庙外现挂着招牌，丸散膏丹，色色俱备，亦长在宁荣两宅走动熟惯，都与他起了个浑号，唤他作‘王一贴’。”他让人记住的是因为他著名的“疗妒汤”，还记得怎么吃吗？至于有没有效，吃完100年就知道了，正如一个笑话的，说某某东东吃了可以长寿，每天早上吃一次，吃够了36500次肯定可以活100岁，呵呵。"
sexflag[308] = 1;
mainflag[308] = 1;

character[309] = "王住儿"
profile[309] = "不明"
sexflag[309] = 1;

character[310] = "王住儿媳妇"
profile[310] = "“迎春乳母子媳王住儿媳妇”，这姓王的怎么这么多都在贾府当差啊，呵呵，39回中，平儿私自给王住儿放假，惹来贾琏埋怨。73回中，王住儿媳妇“正因他婆婆得了罪，来求迎春去讨情”，却因“他们正说金凤一事”，不敢进去。"

character[311] = "王子腾"
profile[311] = "王夫人和薛姨妈的哥哥，凤姐的叔叔，第4回是“京营节度使”，薛蟠即将进京的时候却升任“九省统制”，53回升任“九省都检点”。在25回中宝玉和凤姐“发疯”的时候，他亲自来瞧问过，这是他在书中前80回的唯一一次露面。"
sexflag[311] = 1;

character[312] = "王子腾夫人"
profile[312] = "她与贾府的来往还是比较密切的，第25回提到她过生日，请贾母等人过去，不过贾母和王夫人未去，第二天她就来贾府了，还正好赶上宝玉和凤姐“发疯”。第70回又来过贾府的。"

character[313] = "卫若兰"
profile[313] = "书中只有14回给可卿送殡的时候出来过，现在流行的，湘云嫁给他，而他又早死的说法是从脂批而来的，庚辰本第31回有一段墨批“后数十回若兰在射圃所佩之麒麟，正此麒麟也。提纲伏于此回中，所谓草蛇灰线在千里之外”。但是120回的程乙本没有明说湘云是嫁给他的。"
mainflag[313] = 1;
sexflag[313] = 1;

character[314] = "文官"
profile[314] = "大概是十二戏子中老大的人物，因为书中经常提到她们是都是“文官等人”，遣散她们时，贾母把她留在了身边做丫鬟。不知道她是演什么角色的？"

character[315] = "文花"
profile[315] = "贾珍的侍妾，在第75回，宁府赏月，贾珍“命佩凤吹箫，文花唱曲，喉清嗓嫩，真令人魄醉魂飞。”可见文花的唱功。"

character[316] = "文杏"
profile[316] = "宝钗的小丫头，29回陪宝钗去过清虚观。"

character[317] = "乌进孝"
profile[317] = "黑山村的庄头，53回中来给贾府交租，可见这个黑山村是贾家的地产。"
mainflag[317] = 1;
sexflag[317] = 1;

character[318] = "吴贵妃"
profile[318] = "不明"

character[319] = "吴天佑"
profile[319] = "“又有吴贵妃的父亲吴天佑家，也往城外踏看地方去了。”"
sexflag[319] = 1;

character[320] = "吴新登"
profile[320] = "荣府的银库房的总领，管理贾家的帐目，应该是一个比较有实权的奴才头目，在修建大观园的时候也是主管之一，所以54回，贾母吃年酒的也有他家。"
sexflag[320] = 1;

character[321] = "吴兴"
profile[321] = "不明"
sexflag[321] = 1;

character[322] = "吴兴家的"
profile[322] = "吴兴没有出现在书中，只是借着他老婆才有了他名字在书中露了一下，吴兴家的应该是贾府一个比较有脸面的婆子，也是陪房之一，王夫人组织五大家的抄捡大观园的时候她是其中一个。"

character[323] = "五儿"
profile[323] = "其实应该是柳五儿，厨房柳嫂子的女儿，“虽是厨役之女，却生的人物与平、袭、紫、鸳皆类。”和芳官要好，一心想进怡红院，后因芳官和她互赠玫瑰露和茯苓霜，引发了苓霜事件，五儿因此也被关了一夜，又气又委屈，而大病了一场，庚辰本在77回写到王夫人说“前年我们往皇陵上去，是谁调唆宝玉要柳家的丫头五儿了？幸而那丫头短命死了……”，而程乙本把这句话删除了，在后四十回还写到她进了大观园，不过让宝钗和袭人防着，最终也没有办法接近宝玉。"
mainflag[323] = 1;

character[324] = "五嫂子"
profile[324] = "贾琏说“西廊下五嫂子的儿子芸儿”，还是贾琏“后廊上住的五嫂子的儿子芸儿”，可见这“西廊下”和“后廊上”是同一回事。"

character[325] = "西宁郡王"
profile[325] = "四大郡王之一，11回贾敬生日派人来送礼，14回他的孙子来给可卿送殡，搭了祭棚。"
sexflag[325] = 1;

character[326] = "喜儿"
profile[326] = "这个人物到底是男还是女呢？我怀疑有两个喜儿，分别是一男一女，理由如下：A.35回中“可巧莺儿和喜儿都来了。宝钗知道他们已吃了饭，便向莺儿道：‘宝兄弟正叫你去打络子，你们两个一同去罢。’”能够和莺儿一块出现在宝钗面前，一个小厮多半没这“权限”，呵呵，当然，这个理由有点牵强。B.第65回“只见喜儿寿儿两个正在那里坐着吃酒，见他来了，也都会意”，这里寿儿是个小厮，后来他们在一块睡觉，这里喜儿的男儿身可惜肯定。所以我怀疑喜儿有两个。"
sexflag[326] = 1;

character[327] = "喜鸾"
profile[327] = "第71回“贾(王扁)之母也带了女儿喜鸾”来参加荣府的年宴，因贾母喜欢，因此在荣府多玩了两日。"

character[328] = "夏金桂"
profile[328] = "第79回才第一次出场，一出场就闹了个天翻地覆，“生得亦颇有姿色，亦颇识得几个字。若论心中的邱壑经纬，颇步熙凤之后尘。只吃亏了一件，从小时父亲去世的早，又无同胞弟兄，寡母独守此女，娇养溺爱，不啻珍宝，凡女儿一举一动，彼母皆百依百随，因此未免娇养太过，竟酿成个盗跖的性气。爱自己尊若菩萨，窥他人秽如粪土；外具花柳之姿，内秉风雷之性。”后四十回中，她本想害香菱的，结果毒死了自己，按曹公原意还是应该香菱让她害死了才对，不知道曹公对她的命运是怎么安排的？"
mainflag[328] = 1;

character[329] = "夏奶奶"
profile[329] = "就是夏金桂的妈，夏奶奶是香菱这么称呼她的，“夏奶奶又是没儿子的，一见了你哥哥出落的这样，又是哭，又是笑，竟比见了儿子的还胜。”所以才有了薛蟠和夏金桂的婚事。"

character[330] = "夏婆子"
profile[330] = "“藕官的干娘”，这干娘怎么对自己的干女儿都不好，这个夏婆子看见藕官烧纸就想告发，还鼓动赵姨娘去闹事对付芳官她们。"

character[331] = "夏守忠"
profile[331] = "也就是“六宫都太监”夏太监，因为元春，他来过贾府三次，一次是宣贾政入朝，一次是元春让他来下一道谕，让宝玉及众姐妹住进大观园，第三次是来替元春送端午节礼物。"
sexflag[331] = 1;

character[332] = "香怜"
profile[332] = "是一个外号，因为“生得妩媚风流”，因此送了这么一个外号，呵呵，他、玉爱和宝、秦，“四人心中虽有情意，只未发迹”。呵呵，动龙阳之兴了。"
sexflag[332] = 1;

character[333] = "香菱"
profile[333] = "这又是一个让人怜让人叹的人，名字从“英莲”到“香菱”到“秋菱”就真实地记录了她一生，在被卖进薛家之前，让拐子养着，打骂肯定少不了，应怜啊！进了薛家，宝钗给她改名为“香菱”，应该说这一段时间她过的是她这一辈子最好的生活，还没有正式嫁给薛蟠做小妾，尤其是宝钗带她进大观园后，和众姐妹学诗、斗花、嬉闹玩耍，这一段的生活是“香”的。“自从两地生孤木”后，香味没有了，“菱角菱花皆盛于秋”，可是盛极以后紧接着的就是凋零，“秋天来了，冬天还会远吗？”sigh，“香魂返故乡”也是必然的了。"
mainflag[333] = 1;

character[334] = "湘莲"
profile[334] = "“冷郎君”不冷，他“原是世家子弟，素性爽侠，不拘细事，酷好耍枪舞剑，赌博吃酒，以至眠花卧柳，吹笛弹筝，无所不为。因他年纪又，生得又美，不知他身分的人，却误认作优伶一类。”痛打薛蟠和仗义救薛蟠，直言宁府的丑行，拒婚，甚至出家等无一不表现出他是真正性情中人。"
sexflag[334] = 1;
mainflag[334] = 1;

character[335] = "襄阳侯"
profile[335] = "姓戚，第12回戴权说“昨日襄阳侯的兄弟老三来求我……”，14回，他孙子前来送殡，他本人未出场。"
sexflag[335] = 1;

character[336] = "小蝉"
profile[336] = "探春的丫头，夏婆子的外孙女，有点不分是非地向着自家人，明明是自己的外婆欺压藕官等不成，而结怨藕官，可是她也与这些女孩子不和，先是在她外婆面前告发艾官，然又是在林之孝家的面前添油加醋地告发五儿。"

character[337] = "小道士"
profile[337] = "书中道士应该不少，年龄也有大有小，这里的“小道士”应该是特指清虚观里因为剪灯花而出去晚了的那个小道士，幸亏贾母年老心慈，不但没有为难他，反而叫人拿钱给他买糖吃。"
sexflag[337] = 1;

character[338] = "小红"
profile[338] = "原名林红玉，大管家林之孝的女儿，却在怡红院当一个三等丫头，呵呵，秋纹等排揎她的时候就没有考虑过她的背景吗？她和贾芸的爱情故事是大观园中除了宝黛、龄蔷之外的又一个比较重要的爱情故事。作为大观园中“四玉”之一，应该有更重要的一席，脂、26两回中有眉批，宝玉、凤姐被关在狱神庙后，她和茜雪等曾去探望，可惜后四十回她的笔墨却不多。"
mainflag[338] = 1;

character[339] = "小吉祥"
profile[339] = "赵姨娘身边的小丫头，57回写赵姨娘欲带她回家伴灵，她去向雪雁借衣服，可是雪雁没有借给她。"

character[340] = "小鸠儿"
profile[340] = "春燕的妹妹，何婆的女儿，第59回中名字出来了一下，是春燕说何婆子怎么刻薄芳官等人时提到了她，说是何婆子让小鸠儿先洗了头，然后用剩下的水给芳官她们洗。"

character[341] = "小螺"
profile[341] = "宝琴的小丫头，宝玉生日那天，她曾前去祝寿，后来宝琴带着她参加了生日宴会，还坐了席，呵呵，酒饭后，她和香菱等人在园中斗花。"

character[342] = "小鹊"
profile[342] = "赵姨娘的小丫头，第73回，她来给宝玉报信，因为赵姨娘在贾政面前说过些什么话，她特来提醒宝玉注意。"

character[343] = "小舍儿"
profile[343] = "“是金桂从小儿在家使唤的，因他自幼父母双亡，无人看管，便大家叫他作小舍儿，专作些粗笨的生活。”第80回夏金桂陷害香菱的时候派她去通知香菱上房中取东西。"

character[344] = "小霞"
profile[344] = "彩霞的妹妹，第72回中，彩霞被王夫人打发出去之后，因怕旺儿他儿子的纠缠，想着嫁给贾环，因此打发小霞进来问赵姨娘。赵姨娘也愿意，没想到贾政不着急，倒把她和贾环的好事给耽误了。"

character[345] = "偕鸳（偕鸾）"
profile[345] = "贾珍的侍妾，程乙本中叫“偕鸾”，庚辰本中是“偕鸳”，64回中，尤氏带她去过大观园，后来。她和佩凤两个去打秋千玩耍，因为有“墙里秋千墙外道。墙外行人，墙里佳人笑。”所以，坐在秋千上的女孩总是给我一种特别的感觉，可惜啊，跟了贾珍这酒色之徒。"

character[346] = "谢鲸"
profile[346] = "第14回“定城侯之孙世袭二等男兼京营游击谢鲸”前来送殡。"
sexflag[346] = 1;

character[347] = "兴儿"
profile[347] = "贾琏的心腹小厮，是一个挺可爱的小厮，语言风趣幽默，对大观园的几位小姐、宝玉、贾琏、凤姐都有相当精彩的描述，本想引用一些，无奈太多了，如果有兴趣，可以参考原著65、66两回。"
sexflag[347] = 1;
mainflag[347] = 1;

character[348] = "邢德全"
profile[348] = "“系邢夫人之胞弟，只知吃酒赌钱，眠花宿柳为乐，手中滥漫使钱，待人无二心，因此都唤他‘傻大舅’。”到贾府后，跟着贾珍、薛蟠等人臭味相投，整日赌博喝酒。还因为钱的事和邢夫人赌过气，借着酒劲向贾珍抱怨，不过他有一句话也很对“怨不的他们视钱如命。 多少世宦大家出身的，若提起‘钱势’二字，连骨肉都不认了。”"
sexflag[348] = 1;

character[349] = "邢夫人"
profile[349] = "贾赦之妻，一个有点愚蠢、顽固、自私、无情而又有权利欲的女人。处境比较尴尬，明明是长媳，可是因得不到贾母的好感而没有机会管家，可是又时时想夺权。尴尬人难免尴尬事说明了她的笨，邢大舅酒后的一番话说明了她的自私，对待迎春是无情。可是话又说回来，你又想她能怎样？贾赦荒淫好色，贾母不喜，这就失去了在贾府中斗争的最基本的条件；自己没儿没女，为了要保住大太太的位置，不依着点贾赦恐怕也不行；凤姐名义上是她儿媳，可是一心帮着二房等等。有这么些事，你想想她心里能平衡吗？一旦心里失去了平衡难免就会做出些过分的事。"
mainflag[349] = 1;

character[350] = "邢岫烟"
profile[350] = "“超然如野鹤闲云”，清秀淡雅、聪明漂亮、知书达理、端庄稳重、安贫乐道。和妙玉是“贫贱之交，又有半师之分”，最后嫁给薛蝌，也算是天生地设的一对。（不知道她将怎样被归入薄命司？）"
mainflag[350] = 1;

character[351] = "邢忠"
profile[351] = "邢夫人兄弟，邢岫烟之父，家境艰难，和带着妻子和女儿进京投靠邢夫人。"
sexflag[351] = 1;

character[352] = "杏奴"
profile[352] = "柳湘琏的小厮，在47回柳湘琏欲打薛蟠之前，湘琏让他先行回家。"
sexflag[352] = 1;

character[353] = "绣凤"
profile[353] = "王夫人身边的丫头，第23回，写贾政和王夫人在房中商量事情的时候，她和金钏等人在外伺候。"

character[354] = "绣桔"
profile[354] = "迎春的丫头，第29回和迎春去清虚观，口齿锋利，有点得理不让人，主要是在73回中和玉柱儿媳妇为累金凤一事拌嘴就可看出。她应该和司棋感情不错，司棋走的时候，他俩还在一起哭了一场。"

character[355] = "绣鸾"
profile[355] = "王夫人身边的丫头，第23回，写贾政和王夫人在房中商量事情的时候，她和金钏等人在外伺候。另外第62回中她曾去怡红院给宝玉拜寿。"

character[356] = "薛公"
profile[356] = "庚辰本第4回中说薛家是“紫薇舍人薛公之后，现领内府帑银行商，共八房分。”"
sexflag[356] = 1;

character[357] = "薛蝌"
profile[357] = "薛蟠之从弟，忠厚老成、富贵不淫、洁身自好、自尊自爱（参照了后四十回），有一个出色的妹妹，将会有一个好妻子。"
mainflag[357] = 1;
sexflag[357] = 1;

character[358] = "薛蟠"
profile[358] = "表字文起，说起他，“呆霸王”三字足够了。如果要多几个字就是荒淫无耻、横行霸道、仗势欺人，整日里只知道斗鸡走狗、赏花阅柳、一味游乐。不过仔细分析起来，他也不全无好处，比如没有什么心机，待人够义气，送贾珍棺材板，和柳湘琏结为兄弟并且为他准备结婚度用等等。套一句话，他本质不坏，造成他走向犯罪道路是因为父亲的早亡、母亲的溺爱和生活的环境。"
mainflag[358] = 1;
sexflag[358] = 1;

character[359] = "薛姨妈"
profile[359] = "对于她和宝钗的争议实在太多了，我就不再搀和了，这是个见仁见智的问题，就我自己来说，没有观点。说她真善有证据，说她伪善也能分析出来。说她熟谙人情、善于应酬倒是真的。"
mainflag[359] = 1;

character[360] = "雪雁"
profile[360] = "黛玉从家中带来的小丫头，不怎么懂事。来到贾府，黛玉身边有了紫鹃后，她就只是做些传话、送物等等杂事了。她的安排大概是为了衬托紫鹃吧，两人一个从小跟着的，一个是贾府后来给的，可是在对待黛玉上可以看出差别来，她给人的感觉就是可有可无。"

character[361] = "嫣红"
profile[361] = "提到了几次，但是始终未露脸，她是贾赦得不到鸳鸯后花八百两银子买的一个小妾。程乙本70回说宝玉等人看到一个蝴蝶风筝，宝玉说是嫣红放的，庚辰本说是娇红放的。还有第74回凤姐为自己辩解时提到了她的名字。"

character[362] = "严老爷"
profile[362] = "不知道何许人也，第一回，甄士隐和贾雨村闲聊时“忽家人飞报：‘严老爷来拜。’士隐慌的忙起身”，一个“飞”和一个“慌”大概也可看出这个严老爷的不同寻常。"
sexflag[362] = 1;

character[363] = "杨侍郎"
profile[363] = "第78回中，贾政带着宝玉等人去赏菊，他送给宝玉等人礼物。"
sexflag[363] = 1;

character[364] = "杨提督"
profile[364] = "第12回，他太太身体不好，王夫人命凤姐将整的“独参”配成“独参汤”送去，这是凤姐说出来的，是说给贾代儒听的，为的是要整治贾瑞。"
sexflag[364] = 1;

character[365] = "药官"
profile[365] = "庚辰本没有药官，程乙本中藕官“祭的就是死了的药官儿”，而庚辰本中藕官“他祭的就是死了的菂官”。"

character[366] = "叶生"
profile[366] = "“总理元始三一教门道录司正堂叶生”“道录司”是主管道士的最高官署，“正堂叶生”是总管道士的叫叶生的总头目。"
sexflag[366] = 1;

character[367] = "义忠亲王"
profile[367] = "可卿用的棺材“原系义忠亲王老千岁要的，因他坏了事，就不曾拿去。”"
sexflag[367] = 1;

character[368] = "银蝶"
profile[368] = "尤氏的丫鬟，第75回中，尤氏到李纨处，她来伺候，还教训了炒豆儿几句，后来贾母又让她坐着陪尤氏吃饭。"

character[369] = "银姐"
profile[369] = "卜世仁的女儿，贾芸上她家去借钱，她妈反而打发她去对门借钱，以此来拒绝借钱给贾芸。"

character[370] = "引愁金女"
profile[370] = "太虚环境中的仙姑。"

character[371] = "引泉"
profile[371] = "又是程乙本没有而庚辰本有的一个人物，第24回中，贾芸来找宝玉，两个本子的文字有一段差别相当大，分别是：【庚辰本】“因昨日见了宝玉，叫他到外书房等着，贾芸吃了饭便又进来， 到贾母那边仪门外绮霰斋书房里来。只见焙茗、锄药两个小厮下像棋，为夺“车”正拌嘴；还有引泉、扫花、挑云、伴鹤四五个，又在房檐上掏小雀儿玩。贾芸进入院内， 把脚一跺，说道：“猴头们淘气，我来了。”众小厮看见贾芸进来，都才散了。贾芸进入房内， 便坐在椅子上问：“宝二爷没下来？””而【程乙本】是“贾芸自然也难提，只得回来。因昨日见了宝玉，到外书房等着，故此吃了饭，又进来，到贾母那边仪门外绮散斋书房里来。只见茗烟在那里掏小雀儿呢。贾芸在他身后，把脚一跺，道：“茗烟小猴儿又淘气了！”茗烟回头，见是贾芸，便笑道：“何苦二爷唬我们这么一跳。”因又笑说：“我不叫茗烟了，我们宝二爷嫌‘烟’字不好，改了叫‘焙茗’了。二爷明儿只叫我焙茗罢。”贾芸点头笑着同进书房，便坐下问：“宝二爷下来了没有？””"
sexflag[371] = 1;

character[372] = "莺儿"
profile[372] = "宝钗的大丫头，原名黄金莺，聪明伶俐，双手灵巧，还有很好的审美观点，对汗巾子颜色搭配的那段就很经典。热情活泼，直率天真，比如和春燕妈开玩笑，比较有争议的是“金莺微露意”那一段，有人认为那是主仆二人串通好的，我不认为这样莺儿有什么不对，就算是宝钗故意为之，也只是利用了莺儿的直率而已。"
mainflag[372] = 1;

character[373] = "莺儿妈"
profile[373] = "对于“弄香草”很在行，采了些晒干了辫成花篮葫芦给平儿顽的，难怪莺儿对用柳枝编个什么花篮也很在行，她和叶妈关系不错，宝钗等人把大观园的花草交给了叶妈也就是是交给了她。"

character[374] = "鹦哥"
profile[374] = "庚辰本只在第三回出现，是贾母给黛玉的丫头，对于她是否就是紫鹃，有些争议，大多数人认为她是给了黛玉后黛玉改的名字，不过程乙本有不少地方可以看出她们不是同一个人。比如前80回中就有29回“黛玉的丫头紫鹃、雪雁、鹦哥”（庚辰本是“林黛玉的丫头紫鹃、雪雁、春纤”），至于后四十回，鹦哥单独出现的地方就还有好几处。电视剧中的处理是贾母把鹦哥给黛玉时顺便就改了名字，显得有点怪怪的，不过据说电视剧是为了照顾大多数观众的水平，所以这样也不失为一种好的处理办法。"
mainflag[374] = 1;

character[375] = "鹦鹉"
profile[375] = "第29回“享福人福深还祷福 多情女情重愈斟情”中有一句话“贾母的丫头鸳鸯、鹦鹉、琥珀、珍珠”。"

character[376] = "尤二姐"
profile[376] = "又是一个很值得同情的人，说起来她和三姐都只是尤氏异父异母的妹妹，单纯、善良、软弱了一点，比如她反而替善姐掩饰，有时善良未必也是一件好事。她和三姐性格是截然相反的，我常常想如果三姐不自杀，二姐也未必死的这么早，如果请来的不是那个胡庸医，她也许会因为儿子的到来而身价百倍，可惜这一切都只是设想而已，sigh。"
mainflag[376] = 1;

character[377] = "尤老娘"
profile[377] = "二姐、三姐的亲妈，二姐的亲爹死后，她又嫁给了尤氏的的老爹，做了尤氏的后妈，尤氏之父死后，多亏贾珍接济，说到这，不禁想表扬贾珍两句了，搁到现在，一般人就未会去管这“后丈母娘”的死活了。"

character[378] = "尤三姐"
profile[378] = "借用网友flyboy的几句话“比之凤姐，泼辣而不狠毒；比之金钏，刚烈而不恭驯；比之可卿，淫丽而不沉沦；比之黛玉，坚执而不缠绵；比之晴雯，豪爽而不怨尤”。他本来有一句“比之岫烟，贫寒而不卑微”，不过“卑微”是“地位低下或者衰微”的意思，我觉得用在这儿不妥，换成“自卑”也不大合适，因为我并不认为岫烟表现出自卑来。"
mainflag[378] = 1;

character[379] = "尤氏"
profile[379] = "宁府的当家大奶奶，也是书中所写宁府女辈的最高辈份（难道贾敬的妻妾都去世了吗？按说不应该啊）。性格有点胆小和懦弱，管不住自己胡作非为的丈夫；对丈夫和儿媳之间暧昧的关系只能装聋作哑；贾珍要把二姐嫁给贾琏，她明知不妥，也不敢阻难；凤姐大闹宁国府，她也只有赔罪的份；58回中她协理荣府时，荣府简直闹翻了天。不过她也是一个老实厚道的人，比如她放过两个不把她放在眼里的婆子；在75回从炒豆儿服侍她时不跪也可看出她对下人也是比较宽松的；再就是尽管凤姐大闹了宁府，她一点也不记仇，不但来荣府时真心实意去看望凤姐，而且尽心尽力把凤姐的生日办的十分热闹。"
mainflag[379] = 1;

character[380] = "于老爷"
profile[380] = "第7回智能儿回周瑞家的，道：“我们一早就来了。我师父见了太太，就往于老爷府内去了，叫我在这里等他呢。”"
sexflag[380] = 1;

character[381] = "余信"
profile[381] = "不明"
sexflag[381] = 1;

character[382] = "余信家的"
profile[382] = "夫妻两人管着各庙的月例银子，这不“（智能）他师父一来，余信家的就赶上来，和他师父咕唧了半日”。象这里的“各庙”应该指的是贾府的家庙吧，红楼梦中，贾家到底有多少家庙呢？提到家庙的好像只有铁槛寺（宝玉提到过），那馒头庵、水仙庵、清虚观算什么呢？这些仅仅是私下关系比较好的寺庙？我记得至少馒头庵的月利钱也是贾府掏的（第7回）。抄家时，家庙是否也被接管呢？就算京城里每个大户人家有一处家庙，这么多豪门大族，还有皇族，那京城得有多少处寺庙啊？呵呵。"

character[383] = "俞禄"
profile[383] = "宁府的小管家，贾敬去世后，“所用棚杠孝布并请杠人青衣”还缺610两银子，他到库上去领，竟然无法发给，于是请示贾珍，最后把甄家送来的吊祭的银子拿来，又向贾琏借了些才勉强凑齐了，可见这个时候宁府已经走向衰败了。可卿、贾敬（或者说还有贾母）三人辈份一个比一个高，但是葬礼一个比一个拮据（或许贾母根本就没有葬礼），也可以看出贾府衰败的脚步了。"
sexflag[383] = 1;

character[384] = "玉爱"
profile[384] = "贾府私塾中的学生，和香怜是一对，都是生的妩媚风流，而又性格多情。可以说学童大闹学堂正是他们俩引起的。"
sexflag[384 ] = 1;

character[385] = "玉钏"
profile[385] = "姓白，金钏的妹妹，也是王夫人的大丫头，姐姐金钏死后，王夫人把她姐姐的月例钱给了她，我觉得就算说王夫人真的是伪善，但是如果说金钏死后，她完全没有一丝后悔也是不确切的。金钏死后，她似乎一直不能原谅宝玉，哪怕是宝玉在挨打后哄着她尝荷叶汤，和在凤姐生日那天偷偷跑出去祭奠金钏都无法让她彻底解开这个心结，是啊，这些都无法换回死去的姐姐了。……呵呵，其实在贾府当一个大丫头也还是不错的，象玉钏，王夫人让她和莺儿送汤，她觉得烫，让婆子端着，她们俩倒都空着手。"
mainflag[385] = 1;

character[386] = "玉官"
profile[386] = "十二戏子之一，是个正旦，第30回，宝官、玉官、袭人等把沟堵了，水积在院内，把些鸭啊、鸟啊，鸳鸯什么的，缝了翅膀，放在院内顽耍，呵呵，可见任何人都有调皮的时候。这个玉官笔墨不多，遣散剧团的时候，她大概是离开了的。"
mainflag[386] = 1;

character[387] = "鸳鸯"
profile[387] = "鸳鸯姐姐，贾母的贴身丫头，也是最得力的丫头，不光管着贾母的衣食起居，还管理着贾母的金银细软，这也是她不幸的原因之一，贾赦看上她，可能有她长得好的原因，我觉得还很可能是贾赦想通过她在贾母死后得到更多的贾母的遗产。贾母不愿意把她给了自己的大儿子，也许有她不喜欢贾赦的原因，但是更多的是她确实离不开鸳鸯，可是贾母是否考虑过鸳鸯的终身大事呢？在这个方面，贾母表现得应该说也有些自私。鸳鸯不光能干，也很善良，比如作弄了刘姥姥，能事后向刘姥姥道歉，比如遇到了司棋和潘佑安幽会，她能替他们保密，要知道这也是要担风险的。鸳鸯敢于拒绝贾赦，说明她也是一个富有反抗精神的，晴雯也富有反抗精神，可是她们俩正好相反，晴雯性格外露、口齿锋利，鸳鸯则待人宽和、平时不露锋芒；晴雯是暴炭，行为不顾后果，鸳鸯则颇有心计，善于斗争，呵呵，可惜啊，不论采取哪种方式，在那个环境下最终都逃不脱悲惨的命运。"
mainflag[387] = 1;

character[388] = "圆心"
profile[388] = "地藏庵的尼姑，在第77回，拐骗了蕊官藕官去做活使唤，书中的和尚尼姑都没什么好人，可见曹雪芹和宝玉一样，也是毁僧谤道的，呵呵。（程本中该人物叫圆信）"

character[389] = "粤海将军"
profile[389] = "姓邬，第71回，贾母生日时，送来了一架玻璃的大屏，贾母吩咐要留着以备今后送人。"
sexflag[389] = 1;

character[390] = "云儿"
profile[390] = "锦香院的妓女，第28回中陪冯紫英、薛蟠、宝玉等人喝酒，她多少是有点才艺的，可是她的身份注定了她的无依无靠和受欺凌，正如她自己唱的“女儿悲，将来终身指靠谁？女儿愁，妈妈打骂何时休！”。对了，她是怎么知道宝玉的丫头叫袭人的？这只能说明她和宝玉不止在一起喝过一次酒，呵呵。"

character[391] = "云光"
profile[391] = "长安节度使，“久受贾府之情”，贪赃枉法，趋炎附势之徒。受凤姐之托，拆散了张金哥和原任长安守备公子的婚事，金哥和原任长安守备公子先后自杀，虽说这事的最大元凶是长安知府的小舅子，但是云光也是最大的帮凶之一。"
sexflag[391] = 1;

character[392] = "詹光"
profile[392] = "本名“沾光”，贾府的清客，终日无所事事，靠着陪人说说话，下下棋，讨好讨好主子混点饭吃，抬举他一点，最多也就算一个帮闲的无聊文人。"
sexflag[392] = 1;

character[393] = "詹子亮"
profile[393] = "第42回宝玉说“詹子亮的工细楼台就极好”，可以看出他很可能确实在绘画方面还是有两下子的，他本人在书中未正面出现。"
sexflag[393] = 1;

character[394] = "张材"
profile[394] = "不明"
sexflag[394] = 1;

character[395] = "张材家的"
profile[395] = "张材未出场，张材家的出来的次数也不多，是凤姐手下的一个管事婆子，大概是主管裁缝和绣匠之事，因为凤姐协理宁国府的时候她曾帮着管裁缝们做车轿围子的事，她这之后的出场就看不出具体管什么了。只有在刘姥姥二进荣府的时候和周瑞家的一起陪过刘姥姥。"

character[396] = "张大爷"
profile[396] = "薛家总管，第67回，薛蟠从江南回来，把带给薛姨妈和宝钗的礼物忘了，他派人送过来。"
sexflag[396] = 1;

character[397] = "张道士"
profile[397] = "清虚观的道士，这“牛鼻子”可不简单，“是当日荣国府国公的替身，曾经先皇御口亲呼为‘大幻仙人’，如今现掌‘道录司’印，又是当今封为‘终了真人’，现今王公藩镇都称他为‘神仙’。”第29回，贾家众人到清虚观打蘸，他前前后后的伺候着，奉承着老太太，讨好着姑娘奶奶们，又是哭又是笑的，可见他也是个深通世故、八面玲珑、应付自如的人物。"
mainflag[397] = 1;
sexflag[397] = 1;

character[398] = "张德辉"
profile[398] = "第48回，“年过六十，自幼在薛家当铺内揽总，家内也有二三千金的过活”，平时给薛蟠提提建议，出出主意。薛蟠挨了柳湘琏的打，想出去躲躲，想同他一块去贩货，于是薛姨妈把他请来，亲自嘱咐他照管薛蟠。"
sexflag[398] = 1;

character[399] = "张法官"
profile[399] = "第29回，“将至观前，只听钟鸣鼓响，早有张法官执香披衣，带领众道士在路旁迎接。”这张法官是不是就是张道士呢？有点象又不敢确定，暂时当作两个人吧。"
sexflag[399] = 1;

character[400] = "张华"
profile[400] = "尤二姐的未婚夫，也不是个好东西，“现在才十九岁，成日在外嫖赌，不理生业，家私花尽，父亲撵他出来，现在赌钱厂存身。父亲得了尤婆十两银子退了亲的，这女婿尚不道。”媳妇没了都不知道，凤姐让他告，也没那胆，可是后来受银两的诱惑，便不顾后果的告了贾琏，幸亏旺儿还有点良心，否则他真是连死都不知道是怎么死的。"
sexflag[400] = 1;


