

character[401] = "张如圭"
profile[401] = "“当日同僚一案参革的号张如圭者。他本系此地人，革后家居，今打听得都中奏准起复旧员之信，他便四下里寻情找门路，忽遇见雨村，故忙道喜。”这为贾雨村送黛玉进京设了引线。"
sexflag[401] = 1;

character[402] = "张若锦"
profile[402] = "陪宝玉出门的。先前感叹过一次，再看这一段，忍不住还想感叹一下，有钱人就是不一样啊，“宝玉慢慢的上了马，李贵和王荣笼着嚼环，钱启周瑞二人在前引导，张若锦、赵亦华在两边紧贴宝玉后身。”“慢慢的、引导、紧贴”参照这几个词语想一想当时的画面，是羡慕了还是嫉妒了，呵呵。"
sexflag[402] = 1;


character[403] = "张友士"
profile[403] = "“冯紫英幼时从学的先生，学问最渊博的，更兼医理极深，且能断人的生死。今年是上京给他儿子来捐官，现在他家住着呢。”他给可卿看完病后和贾蓉说的那一段可以看出他的医道是非常高明的。尤其是“大爷是最高明的人。人病到这个地位，非一朝一夕的症候，吃了这药也要看医缘了。”正所谓大夫治得了病而治不了命。"
sexflag[403] = 1;

character[404] = "张真人"
profile[404] = "第25回，宝玉和凤姐发疯了，“当下众人七言八语，有的说请端公送祟的，有的说请巫婆跳神的，有的又荐玉皇阁的张真人，种种喧腾不一。”呵呵，好像这姓张的人中和尚道士还不少。"
sexflag[404] = 1;

character[405] = "昭儿"
profile[405] = "贾琏和凤姐的小厮，林如海重病时，贾琏送黛玉回苏州，昭儿是一块跟着去的。林如海死后，他被打发回来报信、请安。当着众人，凤姐只是简单地问了几句，恐惹人笑话，等晚上了再把昭儿叫来，细细打听，还连夜给贾琏打点衣服，而且还特别嘱咐“在外好生小心伏侍，不要惹你二爷生气；时时劝他少吃酒，别勾引他认得浑账老婆，－－回来打折你的腿”。呵呵，这几句话把凤姐对贾琏的关心和她当时做小媳妇的心态描写得极为生动。所以说我觉得凤姐和贾琏之间并不是没有真感情的，只是太多的时候被利益冲淡了。"
sexflag[405] = 1;

character[406] = "昭容"
profile[406] = "元春省亲时，侍奉元春的宫女，应该不止一个人，昭容也不是她们的名字而是一种职位名，引领元春下舆，还负责传谕等等一些事。"

character[407] = "赵国基"
profile[407] = "赵姨娘的兄弟，伺候贾环上学，在血缘上是探春和贾环的亲舅舅，可是除了赵姨娘外，恐怕其他人未必认同这一点，探春质问赵姨娘“环儿出去为什么赵国基又站起来，又跟他上学？为什么不拿出舅舅的款来？”我能理解探春说这段话的原因和目的，但是总是无法接受，因为“百善孝为先”是我做人的第一信条。"
sexflag[407] = 1;

character[408] = "赵嬷嬷"
profile[408] = "贾琏的乳母，赵天栋、赵天梁两兄弟的母亲，是一个见识过不少大事的老太太，对于接驾，她很清楚“也不过拿着皇帝家的银子往皇帝身上使罢了！谁家有那些钱买这个虚热闹去？”她也是一个世故的老太太，虽然是贾琏的乳母，但是她不像宝玉的奶妈一样居功自傲，不知深浅，她很清楚自己的地位，所以“贾琏凤姐忙让吃酒，令其上炕去。赵嬷嬷执意不肯。”"
 
character[409] = "赵侍郎"
profile[409] = "贾家的世交好友，第29回，贾母到清虚观打醮，他得知消息后，随即派人送礼来。呵呵，我一直不大明白，为什么贾府打醮，他们的“远亲近友世家相与都来送礼”？这是一种什么礼节？"
sexflag[409] = 1;

character[410] = "赵天栋"
profile[410] = "贾琏奶妈赵嬷嬷的儿子，应该也是贾琏的奶兄弟了，赵嬷嬷求凤姐给他哥俩安排点活，凤姐就派他哥俩跟着贾蔷到江南采办东西。"
sexflag[410] = 1;

character[411] = "赵天梁"
profile[411] = "呵呵，大家猜一猜他和赵天栋哪个是哥哥，本来嘛，栋梁栋梁，天栋基本上能肯定是哥哥，可是呢赵嬷嬷说“一个叫赵天梁，一个叫赵天栋”，天梁反而放在前面，一般父母在不带偏爱说起自己儿子的时候，哥哥是放在前面的，不过我还是猜天栋是哥哥，因为赵嬷嬷可能平时就偏爱天梁，或者是这个时候赵嬷嬷有点没有完全清醒过来，不是“彼时赵嬷嬷已听呆了话”吗，呵呵。"
sexflag[411] = 1;

character[412] = "赵姨娘"
profile[412] = "我本想用“哀其不幸，怒其不争”，可是想想，她的不幸比起红楼中大多人来说说不上不幸，她的不争就更说不过去了，本来就是奴才出身，没有什么学问，从小在这么一个环境下长大，除了知道争权夺利她还知道什么，怎么去争。有网友提出一个让人感到害怕的问题“如果晴雯不死，会不会是另外一个赵姨娘”，那么是不是可以想一想“赵姨娘年轻的时候是不是另外一个晴雯呢”，她和贾政有没有过两小无猜呢？贾政有没有给她蓖过头，画过眉呢？她的不幸除了她自己本身的性格和她的出身外，如果要说最大的外来因素，那就是来自于宝玉，自己的儿子远不如宝玉，嫉妒成了她生活的全部，也扭曲了她的灵魂。这样的人该不该寄与同情呢，我不知道。"
mainflag[412] = 1;

character[413] = "赵亦华"
profile[413] = "又是一个跟着宝玉出门的。“李贵和王荣笼着嚼环，钱启周瑞二人在前引导，张若锦、赵亦华在两边紧贴宝玉后身。”呵呵，本想再来感叹一次，可是又怕人扔臭鸡蛋，只好打住。钱启周瑞在前引导，肯定是在最前头的，他们俩估计也是他们这六人中地位最高的，李贵和王荣笼着嚼环，在马的前面，在周瑞他们身后，可见地位比周瑞低，张若锦、赵亦华紧贴宝玉后身，应该是在马的两边了，所以是这六个人中最后的两个，所以地位也是最低的。旁证：周瑞是陪房，李贵是奶兄，赵亦华什么也不是。"
sexflag[413] = 1;

character[414] = "珍珠"
profile[414] = "贾母的丫头，第29回跟着去清虚观了。庚辰本中没有出现别的叫珍珠的又是指人的地方了。"

character[415] = "甄宝玉"
profile[415] = "“钦差金陵省体仁院总裁”的宝贝儿子，在前80回并未正面出场，不过即使是这样，这个人物还是很难写的一个。从贾雨村口中已经大概知道他小时候性格完全就是贾宝玉的一份拷贝。从他家派来的四个婆子的口中也可以知道他的相貌也是贾宝玉的拷贝。无法知道曹雪芹最后会给他安排一个什么样的结局了，不过我觉得程本中给他的结局是可以接受的，而且这样写的好处是可以更加衬托出贾宝玉的不一样来。"
mainflag[415] = 1;
sexflag[415] = 1;

character[416] = "甄夫人"
profile[416] = "甄宝玉之母，第57回中带着她女儿去过贾府，宝玉还特意去见过她。"

character[417] = "甄士隐"
profile[417] = "红楼四大线索人物之一，“君子之道费而隐”所以曹公给他取名为甄费，字士隐，谐音“真事隐”。他“禀性恬淡，不以功名为念，每日只以观花修竹，酌酒吟诗为乐，倒是神仙一流人品。”全书以他和贾雨村开始，程本在最后又让这俩人同时出现，估计曹公也会这么写。曹公安排这两个人物是想让他们一虚一实地引导着故事向前发展。如果说贾雨村是入世的代表，那么甄士隐就是出世的代表了。关于他们俩在书中的作用恐怕几句话说不清楚，在此先略过。"
mainflag[417] = 1;
sexflag[417] = 1;

character[418] = "臻儿"
profile[418] = "“香菱的丫头”，这可真是“奴才的奴才”了。事不多，传传话，送送东西什么的。清虚观打醮香菱带她去了。"

character[419] = "郑好时媳妇"
profile[419] = "第34回“周瑞媳妇、吴新登媳妇、郑好时媳妇这几个有年纪常往来的，听见宝玉捱了打，也都进来。”"

character[420] = "郑华家的"
profile[420] = "王夫人陪房，“现在五家陪房进来，余者皆在南方各有执事。”看来王夫人不止五家陪房，可见她们家的气派，凤姐把她带来的人除了平儿都打发干净了，按照这个架式，恐怕也得打发好一阵子呐。郑华家的是抄捡大观园的执行者之一。"

character[421] = "智能"
profile[421] = "水月庵的小尼姑，净虚的徒弟，“自幼在荣府走动，无人不识，因常与宝玉秦钟顽笑。他如今大了，渐知风月，便看上了秦钟人物风流，那秦钟也极爱他妍媚，二人虽未上手，却已情投意合了。”可惜当时的环境不容许她那种位置的人有任何私人感情。六根未净，而要呆在寺院，这确实是一件很痛苦的事。不知道当初净虚是怎么把她骗进去的，不管是怎么骗进去的，反正净虚又害苦了一个人。不过不管是什么时代，我认为尼姑和尚都必须得遵守他们所必须遵守的清规戒律，否则和尚不像和尚，尼姑不像尼姑，就有点乱套了。"
mainflag[421] = 1;
sexflag[421] = 1;

character[422] = "智善"
profile[422] = "水月庵的小尼姑，净虚的徒弟，凤姐一帮人到水月庵的时候，她曾随净虚出来迎接。后她又让智能摆果子，大概她是师姐吧。"

character[423] = "智通"
profile[423] = "水月庵的老尼姑，从法号来看，她应该和智能、智善是同一辈的，也许是净虚的师侄什么的。第77回，芳官等人闹着要出家，她和圆心“巴不得又拐两个女孩子去作活使唤”因此她把芳官带走了。"

character[424] = "忠顺王爷"
profile[424] = "和贾府关系不大好，因丢了琪官，听人说琪官和宝玉关系好，于是他派人上贾府要人去了。有人说后来贾府的被抄和他还有关系，只是书上没有而已，不过他干出这样的事也很正常。"
mainflag[424] = 1;
sexflag[424] = 1;

character[425] = "忠顺府长史官"
profile[425] = "这就是当时忠顺王爷派到贾府去要人的那位。"
sexflag[425] = 1;

character[426] = "钟情大士"
profile[426] = "太虚幻境的仙姑之一。"

character[427] = "周奶妈"
profile[427] = "湘云的奶妈，第31回，她跟湘云到贾府，大家一起回忆起湘云当年淘气的事，宝钗问她湘云是不是还这么淘气。呵呵，知根知底的几个人回忆回忆当年的逸闻趣事，取笑取笑对方和自己是一件很温馨的事。"

character[428] = "周贵人"
profile[428] = "第16回，“现今周贵人父亲已在家里动了工了，修盖省亲别院呢。”"

character[429] = "周瑞"
profile[429] = "周瑞家的的丈夫，呵呵。哥儿出门，他得跟着，至于具体还管哪些事，庚辰本看不出来，程本中可以知道他在荣府管着春秋两季的租子，也是一个很重要的职务。"
sexflag[429] = 1;

character[430] = "周瑞家的"
profile[430] = "王夫人的陪房，是最有面子的一个陪房，也是王夫人的心腹。冷子兴的丈母娘，呵呵，难怪冷子兴对贾家这么熟悉。她在书中也是干了不少“大事”的，比如将刘姥姥带进了贾府，抄捡了大观园，尤其是司棋的那封情书就是她发现的，司棋也是她拽出去的。"
mainflag[430] = 1;

character[431] = "周太监"
profile[431] = "第72回，贾琏说“昨儿周太监来，张口一千两。我略应慢了些，他就不自在。”可见宦官在任何朝代都是得罪不起的。"
sexflag[431] = 1;

character[432] = "周姨娘"
profile[432] = "贾政的妾，挺安分守己的，自己没儿没女，加上可能性格平和一点，而且很清楚自己作妾的身份和地位，所以“怎不见人欺他，他也不寻人去”。不知道赵姨娘如果也没儿没女，会不会象周姨娘一样安分守己？其实赵姨娘是一个很悲剧的人物，想靠着已成为主子的儿女来改变自己作为奴才的地位和命运，可惜在那个环境下，这样地努力和挣扎都只能是徒劳的。"
mainflag[432] = 1;

character[433] = "周氏"
profile[433] = "第23回，“后街上住的贾芹之母周氏，正盘算着也要到贾政这边谋一个大小事务与儿子管管， 也好弄些银钱使用，可巧听见这件事出来，便坐轿子来求凤姐。凤姐因见他素日不大拿班作势的，便依允了。”于是贾芹便得到了那个管理小沙弥和小道士的活。"

character[434] = "朱大娘"
profile[434] = "“就是官媒婆那朱嫂子。因有什么孙大人家来和咱们求亲，所以他这两日天天弄个帖子来赖死赖活。”原来迎春的不幸还有她欠下的一笔帐！"

character[435] = "篆儿"
profile[435] = "“邢岫烟的丫头篆儿”，第57回，她把邢岫烟的当票悄悄地交给莺儿，却被湘云看见了。第62回，她和一大帮丫头来给宝玉拜寿。另外在庚辰本中第52回，晴雯病了，急的乱骂大夫时，“唬的小丫头子篆儿忙进来问”；而程乙本是“唬了小丫头子定儿忙进来问”。我觉得这可能是庚辰本传抄时留下的一个小错误，因为邢岫烟的丫头不可能到怡红院服侍晴雯的。不过这个定儿在程乙本中也只出来了这一次。"

character[436] = "坠儿"
profile[436] = "宝玉屋里的小丫头，她的两件大事其一是领着贾芸进了大观园，然后无意中在贾芸和小红之间穿针引线，凑成了他俩的好事。另外一件就是偷了凤姐的镯子，事发后被晴雯赶了出去。"

character[437] = "坠儿娘"
profile[437] = "在三门外头当差的婆子，坠儿偷东西事发后，晴雯打发人叫她进去把坠儿领出去，她心中不满，想抓住晴雯无意中叫宝玉的名字而作些文章，不想反被麝月一顿抢白，无话可说，只得抱恨而去。"

character[438] = "紫鹃"
profile[438] = "贾府的丫头，黛玉进贾府后就服侍黛玉。关于她，其实不用多说，因为几乎所有人对于她都是没有争议地赞赏，她热情聪慧、对黛玉忠心耿耿、尽心尽力，也只有她敢于当面指责黛玉太小性儿，她们的关系已经不是主子和丫头的关系，而是胜似亲姐妹的关系，是肝胆相照的朋友的关系。也难怪宝玉说出“好丫头，‘若共你多情小姐同鸳帐，怎舍得叠被铺床？’”。"
mainflag[438] = 1;

character[439] = "紫绡"
profile[439] = "程本中没有的一个人物，是宝玉的丫头，元春送了端午节的礼物给大家，宝玉让紫绡捧着去找黛玉，让黛玉喜欢什么就留下什么。还有就是第62回和麝月、秋纹、碧痕等人抓子儿赢瓜子儿打发时间。"

character[440] = "绮霰"
profile[440] = "宝玉的丫头，是和晴雯一样的上等丫头，不过书中关于她的描写不多，只有三两处，一是佳蕙对她和晴雯是上等不满。还有一处是第27回，众人“审”小红的时候，她也说了一句“你听听他的嘴！你们别说了，让他逛去罢。”"

character[441] = "袭人"
profile[441] = "关于她的争议一点也不比钗黛之间的争议要少，说她好的有温柔、贤惠、善良、对宝玉尽心尽力等等，说她不好的有她引诱、包围、挟制宝玉，打小报告，排挤、陷害同伴，附和、讨好王夫人等等。其实如果把她当作普通一个人来看，这些都是可以理解的，她也有血有肉，有自己的私欲。我想拥她的多想想她的坏处，贬她的多想想她的好处，别走极端也就都能平和地接受她了。呵呵，我是一个中庸派。"
mainflag[441] = 1;

character[442] = "林黛玉"
profile[442] = "“我喜欢的女孩要象黛玉一样有才气，还要象黛玉一样弱不禁风”，黛玉的才，有菊花诗为证，她活得真实、坦诚，敢恨敢爱，这恐怕是大多人喜欢她的原因。关于她的争议大多在于她的小性儿，可是这也正是她极爱宝玉的表现，在她知道宝玉的真心后，她就基本上没有使什么小性儿了。"
mainflag[442] = 1;
goldflag[442] = 1;

character[443] = "贾元春"
profile[443] = "“我喜欢的女孩要象元春一样有福气”，其实元春并有没有福气，正如她自己说的，到了那个不得见人的地方，可见她即使得到了皇帝的宠爱，可是心里还是苦的。在宝玉的婚事上，我并不认为元春是反对宝黛的最大阻力因为一、元春和宝钗黛玉的接触时间那么短，她怎么会这么坚决的反对黛玉呢？二、元春可能对于功名富贵的认识比贾府中的任何一人都要认识得清楚，我觉得她不会让她心爱的弟弟为了功名而放弃幸福！"
mainflag[443] = 1;
goldflag[443] = 1;

character[444] = "贾探春"
profile[444] = "“我喜欢的女孩要象探春一样能干”，探春确实是极能干的，想想一个包产到户到了20世纪70年代末在中国推行的时候还遇到过多大的阻力，而作为一个封建社会的贵族小姐能意识到这一点有多了不起，呵呵，毛泽东这么爱看红楼梦，他怎么就没有好好琢磨琢磨这一段呢？对于探春最大的争议恐怕在于她对赵姨娘的态度，其实在这一方面，我也有些不能接受，不过还是能理解她，因为这个母亲实在太不争气了，如果实在不能改变，那么拒绝承认也许是一种最好的让自己省心的办法。"
mainflag[444] = 1;
goldflag[444] = 1;

character[445] = "贾迎春"
profile[445] = "“我喜欢的女孩要象迎春一样呆头呆脑”，也许她的才气是不如钗黛和探春，但是绝对说不上呆头呆脑，或者可以说她不喜与人一争长短，也许是见惯了家族中的钩心斗角，感到厌倦了，于是与世无争，能躲的尽量躲。不过不可否认地她性格中有软弱的一面，自己的东西被下人偷了，自己的丫头被赶出去了，她都不敢出面，以至于最后被她父亲“卖”给了“中山狼”，“一载赴黄梁”，sigh~~~"
mainflag[445] = 1;
goldflag[445] = 1;

character[446] = "贾惜春"
profile[446] = "“我喜欢的女孩要象惜春一样心灰意冷”，她确实是有点冷，司棋被赶走，迎春不说话，那是迎春不敢，可是入画却是惜春坚持要赶走的，可能是她胆小怕事、洁身自好，可是未免还是有点太无情了，也还有点自私。呵呵，不过这种坚持清白，不愿同流合污还是可以肯定的。"
mainflag[446] = 1;
goldflag[446] = 1;

character[447] = "薛宝钗"
profile[447] = "“我喜欢的女孩要象宝钗一样懂事，还要象宝钗一样自私自利”，有人说宝钗依照贾母所喜说自己喜欢热闹戏文，喜欢甜烂食物是为了讨好贾母，我喜欢这样孝敬长辈的“讨好”。宝钗也许是比黛玉更世故圆滑一点，但是我并不认为她有害黛玉之心，为了一宝二奶奶的位置，她至于这样吗，宝玉根本就不是她愿意托付终身的那种男人。说到底，她也是那个环境的受害者，受封建教养的毒害更深一点，所以造成了她这种复杂的性格，行为豁达，却城府极深，在她的冷漠中有着淡淡的温情，可是在脉脉的温情中又蕴藏着疏远和冷淡。"
mainflag[447] = 1;
goldflag[447] = 1;

character[448] = "妙玉"
profile[448] = "“我喜欢的女孩要象妙玉一样矫柔造作”，我签名档里，我最不满的就是这句，可是这句话不是我说的，于是没有擅改。妙玉聪明美丽、才华横溢、博览群书、才思敏捷，心性高洁，甚至她的孤傲不群，都是我很欣赏的。她的最大争议在于她对宝玉的不合身份的感情，可是她出家是不得已的，并不是真正的心如枯槁，作为一个妙龄女子，为什么不能容许她也有七情六欲呢？"
mainflag[448] = 1;
goldflag[448] = 1;

character[449] = "李纨"
profile[449] = "“我喜欢的女孩要象李纨一样忠贞”，她的忠贞一方面来源于她从小的家教，另外一方面恐怕也有自知之明，试想，在这样的家庭，作为荣府长玄孙的母亲，将来必然会有享用不尽的荣华富贵，如果离开了贾府，她又能保证她能找到自己的幸福。她是一个好儿媳、好妯娌、好嫂子、好母亲。呵呵，只是未免有点小气了，正如第45回中大家让凤姐做监社御史时，凤姐说她的。"
mainflag[449] = 1;
goldflag[449] = 1;

character[450] = "王熙凤"
profile[450] = "“我喜欢的女孩要象凤姐一样精明”，她精明能干，可是她活得太累，管理着一大家子的大小事务，算计着一家的钱财和自己的私房，提防着别的女人对她老公的引诱和别的男人对她自己的不轨用心。处处要强，想要压倒别人，于是处处树敌。她的外强却也掩不住她内心的虚弱，没有一个儿子是她最大的心病，也许有一个儿子，她未必会这样泼辣狠毒。"
mainflag[450] = 1;
goldflag[450] = 1;

character[451] = "史湘云"
profile[451] = "“我喜欢的女孩要象湘云一样豪爽，还要象湘云一样不通世务”，她“从未将儿女私情略萦心上”，这就是她同黛玉最大的区别，所以虽然她同黛玉有着相似的身世，却有着完全不一样的性情。她开朗、豁达、豪爽、热情、率真、心直口快，浑身都透着“可爱”。"
mainflag[451] = 1;
goldflag[451] = 1;

character[452] = "秦可卿"
profile[452] = "“我喜欢的女孩要象可卿一样漂亮，还要象可卿一样风流薄命”，虽说书中没有直接描写她有多漂亮，可是宝玉梦中的兼美却是“鲜艳妩媚大似宝钗，袅娜风流又如黛玉”。她的见识，她的思虑在她托给凤姐的梦中表现得淋漓尽至。也许是天妒英才，也许是红颜薄命，我真的宁愿她是病死的，我真的宁愿相信她和贾珍没有暧昧的关系。"
mainflag[452] = 1;
goldflag[452] = 1;


var i = 0;
for(i=453;i<=456;i++)
{
character[i] = character[i-9];
profile[i] = profile[i-9];
sexflag[i] = sexflag[i-9];
mainflag[i]  = mainflag[i-9];
goldflag[i] = goldflag[i-9];
}

